Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopyRevolveAxisWarn Property
 The axis cannot be copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyRevolveAxisWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyRevolveAxisWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyRevolveAxisWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace